### 9.Retrieve the total number of tracks sold by each employee.

- ##### Hint: You will need to join the `employees`, `customers`, `invoices`, `invoice_items`, and `tracks` tables and use the GROUP BY and SUM functions to calculate the total number of tracks sold by each employee.

## Expected Output

| EmployeeId | EmployeeName  | TotalTracksSold |
|-----------|---------------|----------------|
| 3         | Jane Peacock  | 796            |
| 4         | Margaret Park | 760            |
| 5         | Steve Johnson | 684            |

In [1]:
%run setup_notebook.ipynb

In [2]:
%%sql 

SELECT * 
FROM employees
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com')]

In [3]:
%%sql 

SELECT * 
FROM customers
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3)]

In [4]:
%%sql 

SELECT * 
FROM invoices
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98)]

In [5]:
%%sql 

SELECT * 
FROM invoice_items
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 1, 2, 0.99, 1)]

In [6]:
%%sql 

SELECT * 
FROM tracks
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 'For Those About To Rock (We Salute You)', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 343719, 11170334, 0.99)]

In [7]:
%%sql 

SELECT COUNT(t.TrackId)
FROM tracks t
JOIN invoice_items ii ON t.TrackId = ii.TrackId

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(2240,)]

In [8]:
%%sql 

SELECT COUNT(t.TrackId) TrackCount, c.CustomerId
FROM tracks t
JOIN invoice_items ii ON t.TrackId = ii.TrackId
JOIN invoices i ON ii.InvoiceId = i.InvoiceId
JOIN customers c ON c.CustomerId = i.CustomerId
GROUP BY c.CustomerId
LIMIT 3;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
3 rows affected.

[(38, 1), (38, 2), (38, 3)]

In [9]:
%%sql 

SELECT e.FirstName, COUNT(t.TrackId) TrackCount, c.CustomerId
FROM tracks t
JOIN invoice_items ii ON t.TrackId = ii.TrackId
JOIN invoices i ON ii.InvoiceId = i.InvoiceId
JOIN customers c ON c.CustomerId = i.CustomerId
JOIN employees e ON c.SupportRepId = e.EmployeeId
GROUP BY c.CustomerId
LIMIT 3;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
3 rows affected.

[('Jane', 38, 1), ('Steve', 38, 2), ('Jane', 38, 3)]

In [13]:
%%sql 

SELECT e.EmployeeId, 
CONCAT(e.FirstName, ' ', e.LastName) AS EmployeeName, 
COUNT(ii.Quantity) TotalTracksSold
FROM tracks t
JOIN invoice_items ii ON t.TrackId = ii.TrackId
JOIN invoices i ON ii.InvoiceId = i.InvoiceId
JOIN customers c ON c.CustomerId = i.CustomerId
JOIN employees e ON c.SupportRepId = e.EmployeeId
GROUP BY e.EmployeeId, EmployeeName

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
3 rows affected.

[(3, 'Jane Peacock', 796),
 (4, 'Margaret Park', 760),
 (5, 'Steve Johnson', 684)]

## Question 09b

### There are 8 employees and 3503 tracks in total. Confirm that the remaining 5 employees did not make any sales.

In [11]:
%%sql 
-- confirm the total tracks count

SELECT COUNT(*) FROM tracks

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(3503,)]

In [20]:
%%sql 
-- Get a list of employees who have not sold any tracks

SELECT CONCAT(e.FirstName, ' ', e.LastName) AS EmployeeName, 
COUNT(ii.Quantity) TotalTracksSold
FROM employees e
LEFT JOIN customers c ON c.SupportRepId = e.EmployeeId
LEFT JOIN invoices i ON i.CustomerId = c.CustomerId
LEFT JOIN invoice_items ii ON ii.InvoiceId = i.InvoiceId
GROUP BY e.EmployeeId
HAVING TotalTracksSold = 0

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
5 rows affected.

[('Andrew Adams', 0),
 ('Nancy Edwards', 0),
 ('Michael Mitchell', 0),
 ('Robert King', 0),
 ('Laura Callahan', 0)]

In [16]:
%%sql 

SELECT e.EmployeeId, 
CONCAT(e.FirstName, ' ', e.LastName) AS EmployeeName, 
COUNT(ii.Quantity) TotalTracksSold
FROM employees e
LEFT JOIN customers c ON c.SupportRepId = e.EmployeeId
LEFT JOIN invoices i ON c.CustomerId = i.CustomerId
LEFT JOIN invoice_items ii ON i.InvoiceId = ii.InvoiceId
GROUP BY e.EmployeeId, EmployeeName

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
8 rows affected.

[(1, 'Andrew Adams', 0),
 (2, 'Nancy Edwards', 0),
 (3, 'Jane Peacock', 796),
 (4, 'Margaret Park', 760),
 (5, 'Steve Johnson', 684),
 (6, 'Michael Mitchell', 0),
 (7, 'Robert King', 0),
 (8, 'Laura Callahan', 0)]

In [29]:
%%sql 

SELECT 
a.OriginalTrackCount, 
b.UnsoldTrackCount,
(a.OriginalTrackCount - b.UnsoldTrackCount) AS CurrentTrackInventory
FROM 
    (SELECT COUNT(t.TrackId) AS OriginalTrackCount
    FROM tracks t) AS a,
    (SELECT COUNT(t.TrackId) AS UnsoldTrackCount
    FROM tracks t 
    LEFT JOIN invoice_items ii ON t.TrackId = ii.TrackId
    WHERE ii.InvoiceId IS NULL) AS b

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(3503, 1519, 1984)]